---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternRadius
source: html/b01104f0-bc8a-03e2-4325-4c09440f3c85.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternRadius Property

"Radius"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemPatternRadius { get; }
```